In [47]:
import pandas as pd
import numpy as np

In [54]:
d1 = {'a':1,'b':2,'c':3,'d':4}
#type(d1)

# Get the 'key' values in dictionary

keyz = d1.keys()
valuez = d1.values()
print(type(keyz),type(valuez))
print(keyz)
print(valuez)

<class 'dict_keys'> <class 'dict_values'>
dict_keys(['a', 'b', 'c', 'd'])
dict_values([1, 2, 3, 4])

In [55]:
# Save the 'keys' as list members in a list
l1 =list(keyz)
l2 = list(valuez)
print(type(l1),type(l2))
print(l1)
print(l2)
#type(l1)

<class 'list'> <class 'list'>
['a', 'b', 'c', 'd']
[1, 2, 3, 4]

### Convert to Data Frame (example 1)

In [89]:
df1 = pd.DataFrame()
df1['names'] = l1
df1['values'] = l2
df1

  names  values
0     a       1
1     b       2
2     c       3
3     d       4

In [90]:
df1 = pd.DataFrame()
d2 ={'names':l1,'values':l2}
df1 = pd.DataFrame.from_dict(d2)
df1

  names  values
0     a       1
1     b       2
2     c       3
3     d       4

### Convert to Data Frame (example 2)

In [91]:
d2 = {'col_1': [11, 22, 33, 44], 'col_2': ['a', 'b', 'c', 'd']}
df2 = pd.DataFrame.from_dict(d2)
df2

   col_1 col_2
0     11     a
1     22     b
2     33     c
3     44     d

In [88]:
df2_wide = pd.DataFrame.from_dict(d2, orient='index')
df2_wide

        0   1   2   3
col_1  11  22  33  44
col_2   a   b   c   d

In [141]:
d3 = {'col_1': [11, 22, 33, 44],
      'col_2': ['a', 'b', 'c', 'd'],
      'col_3': ['aaa', 'bbb', 'ccc', 'ddd'],
      'col_4': [746, 47, 56, 998]}
df3 = pd.DataFrame.from_dict(d3)
df3

   col_1 col_2 col_3  col_4
0     11     a   aaa    746
1     22     b   bbb     47
2     33     c   ccc     56
3     44     d   ddd    998

### Rename the columns

In [142]:
df3.rename(columns={"col_1": "Number", "col_2": "Letter","col_3": "Letter2","col_4": "Number2"}, inplace=True)
df3

   Number Letter Letter2  Number2
0      11      a     aaa      746
1      22      b     bbb       47
2      33      c     ccc       56
3      44      d     ddd      998

### DataFrame.loc[:,:]

In [143]:
df3.loc[:,['Number','Letter2']]
#df3.loc[:,'Letter':'Number2']
#df3.loc[:,'Letter':]
#df3.loc[:,:'Letter2']
#df3.loc[1:2,'Letter':]

   Number Letter2
0      11     aaa
1      22     bbb
2      33     ccc
3      44     ddd

### DataFrame.iloc[:,:]

In [144]:
# Last indexin works different than .loc
df3.iloc[:,1:3]
df3.iloc[:,2:]
df3.iloc[:,:2]
df3.iloc[1:3,:]
df3.iloc[2:,:]
df3.iloc[[0,3],:]
df3.iloc[1:3,1:3]

  Letter Letter2
1      b     bbb
2      c     ccc

### Derive new Column

In [145]:
df3['new_columns'] = df3.iloc[:,0] + df3.iloc[:,3]
df3

   Number Letter Letter2  Number2  new_columns
0      11      a     aaa      746          757
1      22      b     bbb       47           69
2      33      c     ccc       56           89
3      44      d     ddd      998         1042

### Drop column(s)

In [149]:
# df3.drop('Letter2',axis=1, inplace=True)
df3.drop('Letter2',axis=1)

   Number Letter  Number2  new_columns
0      11      a      746          757
1      22      b       47           69
2      33      c       56           89
3      44      d      998         1042

In [151]:
# df3.drop(['Letter','Letter2'],axis=1, inplace=True)
df3.drop(['Letter','Letter2'],axis=1)

   Number  Number2  new_columns
0      11      746          757
1      22       47           69
2      33       56           89
3      44      998         1042

In [153]:
# df3.drop(df3.iloc[:,2:4],axis=1, inplace=True)
df3.drop(df3.iloc[:,2:4],axis=1)

   Number Letter  new_columns
0      11      a          757
1      22      b           69
2      33      c           89
3      44      d         1042

### Check the sum of Columns

In [155]:
np.sum(df3)

Number                  110
Letter                 abcd
Letter2        aaabbbcccddd
Number2                1847
new_columns            1957
dtype: object

### Quick look at descriptive statistics

In [156]:
df3.describe()

          Number     Number2  new_columns
count   4.000000    4.000000     4.000000
mean   27.500000  461.750000   489.250000
std    14.200939  484.772369   487.863625
min    11.000000   47.000000    69.000000
25%    19.250000   53.750000    84.000000
50%    27.500000  401.000000   423.000000
75%    35.750000  809.000000   828.250000
max    44.000000  998.000000  1042.000000